PK/raw/res.mysql57.wd50/res.82.ro.txt
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 82
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[  10s] threads: 82, tps: 0.00, reads: 87530.60, writes: 0.00, response time: 1.51ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 82, tps: 0.00, reads: 86153.06, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 82, tps: 0.00, reads: 86110.34, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 82, tps: 0.00, reads: 85427.68, writes: 0.00, response time: 1.54ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 82, tps: 0.00, reads: 85615.01, writes: 0.00, response time: 1.54ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 82, tps: 0.00, reads: 86234.58, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 82, tps: 0.00, reads: 85731.80, writes: 0.00, response time: 1.54ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 82, tps: 0.00, reads: 86508.18, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 82, tps: 0.00, reads: 86464.73, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 82, tps: 0.00, reads: 86252.01, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 82, tps: 0.00, reads: 86859.37, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 82, tps: 0.00, reads: 86448.03, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 82, tps: 0.00, reads: 86785.30, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 82, tps: 0.00, reads: 86728.90, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 82, tps: 0.00, reads: 87335.31, writes: 0.00, response time: 1.51ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 82, tps: 0.00, reads: 87143.88, writes: 0.00, response time: 1.51ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 82, tps: 0.00, reads: 86701.09, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 82, tps: 0.00, reads: 86713.91, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 190s] threads: 82, tps: 0.00, reads: 87360.86, writes: 0.00, response time: 1.51ms (95%), errors: 0.00, reconnects:  0.00
[ 200s] threads: 82, tps: 0.00, reads: 86646.55, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 210s] threads: 82, tps: 0.00, reads: 86516.25, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 220s] threads: 82, tps: 0.00, reads: 86260.69, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[ 230s] threads: 82, tps: 0.00, reads: 86682.10, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 240s] threads: 82, tps: 0.00, reads: 86784.94, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 250s] threads: 82, tps: 0.00, reads: 86208.21, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[ 260s] threads: 82, tps: 0.00, reads: 86657.98, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 270s] threads: 82, tps: 0.00, reads: 86869.59, writes: 0.00, response time: 1.52ms (95%), errors: 0.00, reconnects:  0.00
[ 280s] threads: 82, tps: 0.00, reads: 86292.30, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
[ 290s] threads: 82, tps: 0.00, reads: 86310.21, writes: 0.00, response time: 1.53ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            25960623
        write:                           0
        other:                           0
        total:                           25960623
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 25960623 (86534.96 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0016s
    total number of events:              25960623
    total time taken by event execution: 24515.8254s
    response time:
         min:                                  0.19ms
         avg:                                  0.94ms
         max:                                 13.16ms
         approx.  95 percentile:               1.52ms

Threads fairness:
    events (avg/stddev):           316592.9634/112603.78
    execution time (avg/stddev):   298.9735/0.30